Repository: Egiraht/VisaDeviceBuilder
Catalog: VisaDeviceBuilder.WPF/Resources/Localization.*.resx
Languages: ru

source: Reset
ru: Сброс

source: VISA resource name
ru: Имя ресурса VISA

# Connect
source: Connect device
ru: Подключить устройство

# Disconnect
source: Disconnect device
ru: Отключить устройство

source: Initializing
ru: Инициализация

source: Connected
ru: Подключено

source: De-initializing
ru: Деинициализация

source: Disconnected
ru: Отключено

source: Error
ru: Ошибка

source: Searching for resources...
ru: Идёт поиск ресурсов...

# DeviceIsInitializing
source: Initializing the device...
ru: Инициализация устройства...

# DeviceWasInitialized
source: The device has been successfully initialized.
ru: Устройство было успешно инициализировано.

# DeviceIsDeInitializing
source: De-initializing the device...
ru: Деинициализация устройства...

# DeviceWasDisconnected
source: The device has been disconnected.
ru: Устройство было отключено.

# DeviceWasDisconnectedWithError
source: The device has been disconnected because of an error.
ru: Устройство было отключено из-за наличия ошибок.

source: Device identifier
ru: Идентификатор устройства

# AutoUpdateMs
source: Auto-update (мс)
ru: Автообновление (мс)

# SendCommand
source: Send the command
ru: Отправить команду

source: Command response
ru: Ответ на команду

source: Property name
ru: Имя свойства

# PropertyActualValue
source: Current value
ru: Текущее значение

# PropertyNewValue
source: New value
ru: Новое значение

# InvalidVisaDeviceType
source: The specified VISA device type "{0}" does not implement the "{1}" interface.
ru: Указанный тип устройства VISA "{0}" не реализует интерфейс "{1}".

# InvalidResourceManagerType
source: The specified VISA resource manager type "{0}" does not implement the "{1}" interface.
ru: Указанный тип менеджера ресурсов VISA "{0}" не реализует интерфейс "{1}".
